soap/src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="https://github.com/jug2505/JsonToXML">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getUserRequest>
            <gs:data>
                <![CDATA[]]>
            </gs:data>
        </gs:getUserRequest>
    </soapenv:Body>
</soapenv:Envelope>